zolotova/task-8/jmeter-test-app/jmeter/dashboard_report/statistics.json
{
  "new-user" : {
    "transaction" : "new-user",
    "sampleCount" : 299,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8.946488294314381,
    "medianResTime" : 6.0,
    "minResTime" : 5.0,
    "maxResTime" : 146.0,
    "pct1ResTime" : 10.0,
    "pct2ResTime" : 13.0,
    "pct3ResTime" : 115.0,
    "throughput" : 0.2510172916493515,
    "receivedKBytesPerSec" : 0.042898462928355974,
    "sentKBytesPerSec" : 0.06863754068536955
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 299,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8.946488294314381,
    "medianResTime" : 6.0,
    "minResTime" : 5.0,
    "maxResTime" : 146.0,
    "pct1ResTime" : 10.0,
    "pct2ResTime" : 13.0,
    "pct3ResTime" : 115.0,
    "throughput" : 0.2510172916493515,
    "receivedKBytesPerSec" : 0.042898462928355974,
    "sentKBytesPerSec" : 0.06863754068536955
  }
}